Comment: Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of Rectangle and creates a package.
Identifier: com.github.apfelwerk.pkg.Rectangle
ParentRecipe: com.github.apfelwerk.download.Rectangle
MinimumVersion: 1.0.0

Input:
  NAME: Rectangle

Process:
- Processor: AppPkgCreator
