Description: Downloads the latest version of VS Code and then uploads to the JSS
Identifier: com.github.apfelwerk.jss.visualstudiocode
ParentRecipe: com.github.apfelwerk.pkg.visualstudiocode
MinimumVersion: 0.6.1

Input:
  NAME: Visual Studio Code
  CATEGORY: Development
  GROUP_NAME: '%NAME%-update-smart'
  GROUP_TEMPLATE: SmartGroupTemplate.xml
  POLICY_CATEGORY: AutoPKG
  POLICY_TEMPLATE: PolicyTemplate.xml
  SELF_SERVICE_DESCRIPTION: Visual Studio for Mac is a modern, sophisticated IDE with many features for creating mobile, desktop, and web applications.
  SELF_SERVICE_ICON: vscode.png

Process:
- Processor: JSSImporter
  Arguments:
    category: '%CATEGORY%'
    groups:
    - name: '%GROUP_NAME%'
      smart: true
      template_path: '%GROUP_TEMPLATE%'
    policy_category: '%POLICY_CATEGORY%'
    policy_template: '%POLICY_TEMPLATE%'
    prod_name: '%NAME%'
    self_service_description: '%SELF_SERVICE_DESCRIPTION%'
    self_service_icon: '%SELF_SERVICE_ICON%'
